import { z } from "zod";

export const createCategorySchema = z.object({
  name: z
    .string()
    .min(1, "لطفا نام دسته بندی را وارد نمایید.")
    .min(3, "نام دسته بندی باید حداقل 3 و حداکثر 50 کاراکتر باشد.")
    .max(50, "نام دسته بندی باید حداقل 3 و حداکثر 50 کاراکتر باشد."),

  slug: z
    .string()
    .min(1, "لطفا اسلاگ را وارد نمایید.")
    .min(3, "اسلاگ باید حداقل 3 و حداکثر 100 کاراکتر باشد.")
    .max(100, "اسلاگ باید حداقل 3 و حداکثر 100 کاراکتر باشد."),
});

export const updateCategorySchema = z.object({
  id: z.number().min(1),

  name: z
    .string()
    .min(1, "لطفا نام دسته بندی را وارد نمایید.")
    .min(3, "نام دسته بندی باید حداقل 3 و حداکثر 50 کاراکتر باشد.")
    .max(50, "نام دسته بندی باید حداقل 3 و حداکثر 50 کاراکتر باشد."),

  slug: z
    .string()
    .min(1, "لطفا اسلاگ را وارد نمایید.")
    .min(3, "اسلاگ باید حداقل 3 و حداکثر 100 کاراکتر باشد.")
    .max(100, "اسلاگ باید حداقل 3 و حداکثر 100 کاراکتر باشد."),
});
