import { z } from "zod";

export const updateUserAddressInfoSchema = z.object({
  fullName: z
    .string()
    .min(1, "لطفا نام و نام خانوادگی را وارد نمایید.")
    .min(3, "نام و نام خانوادگی باید حداقل 3 و حداکثر 50 کاراکتر باشد.")
    .max(50, "نام و نام خانوادگی باید حداقل 3 و حداکثر 50 کاراکتر باشد."),

  mobile: z
    .string()
    .nonempty("لطفا موبایل را وارد نمایید.")
    .regex(/^0\d{10}$/, "موبایل وارد شده نامعتبر است."),

  postalCode: z
    .string()
    .nonempty("لطفا کد پستی را وارد نمایید.")
    .regex(/^\d{10}$/, "کد پستی وارد شده نامعتبر است."),

  address: z
    .string()
    .nonempty("لطفا آدرس را وارد نمایید.")
    .min(10, "آدرس باید حداقل 10 و حداکثر 256 کاراکتر باشد.")
    .max(256, "آدرس باید حداقل 10 و حداکثر 256 کاراکتر باشد."),
});
